# ReferenceCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..ReferenceCurve Property
HostedSweep Class See Also
---
The curve on which the hosted sweep segment is created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve this[
	Reference targetRef
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReferenceCurve ( _
	targetRef As Reference _
) As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ ReferenceCurve[Reference^ targetRef] {
	Curve^ get (Reference^ targetRef);
}
```

# ### Parameters
targetRef
    Type: Autodesk.Revit.DB..::..ReferenceReference of the curve that hosts the object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration fails. |

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace